<template>
    <div class="contract-paper">
        <!-- Header -->
        <div class="header font-bold text-xl">
            <h1 class="mb-2">สัญญาเปิดศูนย์บริการลูกค้า ภายใต้แบรนด์ ทศกัณฐ์</h1>
            <h1 class="mb-2">(TOSSAGUN)</h1>
            <h1 class="mb-2">ทศกัณฐ์ วันสต็อป ช็อป (ONE STOP SHOP)</h1>
            <h1 class="mb-2">"มีที่ ไม่มีทุน"</h1>
        </div>

        <article class="text-wrap mb-3">
            <p class="indent-8 text-justify">
                สัญญาฉบับนี้จัดทำขึ้น ณ บริษัท ทศกัณฐ์ ดิจิตอล นิวเจนเนอเรชั่น จำกัด เมื่อวันที่ 
                <span class="text-red-500">{{ currentDate }}</span>
                ระหว่าง บริษัท ทศกัณฐ์ ดิจิตอล นิวเจนเนอเรชั่น ทะเบียนบริษัทเลขที่
                <span class="text-red-500">...TAX ID...</span>
                สำนักงานใหญ่ ตั้งอยู่ <span class="text-red-500">...Address...</span>
                ซึ่งต่อไปในสัญญาฉบับนี้ เรียกว่า <strong>“บริษัทฯ”</strong> ฝ่ายหนึ่งกับ
                <span class="text-red-500">...Customer name...</span>
                ซึ่งต่อไปนี้เรียกว่า <strong>“ผู้เปิดศูนย์”</strong> ในการให้บริการตามแผนการตลาดของ บริษัทฯ การรับสมัครสมาชิก/การให้บริการสมาชิก การขายสินค้าทุกประเภท และการบริการทุกประเภท โดยบริษัทฯ เป็นศูนย์กลางในการให้ข้อมูล และประสานงาน ทั้งสองฝ่ายตกลงทำสัญญากันดังมีข้อความต่อไปนี้ 
            </p>
        </article>

        <article class="text-wrap mb-3">
            <h1 class="mb-2"><strong>1. คำจำกัดความ</strong></h1>
            <p class="indent-8 text-justify">
                1.ลายมือชื่ออิเล็กทรอนิกส์ หมายถึง ว่าด้วย พระราชบัญญัติว่าด้วยธุรกรรมทางอิเล็กทรอนิกส์ พ.ศ. 2544  ลายมือชื่ออิเล็กทรอนิกส์ หมายถึง อักษร อักขระ ตัวเลข เสียง หรือสัญลักษณ์อื่นใดที่สร้างขึ้นให้อยู่ในรูปแบบอิเล็กทรอนิกส์ซึ่งนำมาใช้ประกอบกับข้อมูลอิเล็กทรอนิกส์ เพื่อแสดงความสัมพันธ์ระหว่างบุคคลกับข้อมูลอิเล็กทรอนิกส์ โดยมีวัตถุประสงค์เพื่อระบุตัวบุคคลผู้เป็นเจ้าของลายมือชื่ออิเล็กทรอนิกส์ที่เกี่ยวข้องกับข้อมูลอิเล็กทรอนิกส์นั้น และเพื่อแสดงว่าบุคคลดังกล่าวยอมรับข้อความในข้อมูลอิเล็กทรอนิกส์นั้น
            </p>
            <p class="indent-8 text-justify">
                2.ผู้เปิดศูนย์ หมายถึง ผู้เปิดศูนย์บริการลูกค้า ทุกประเภทของบริษัทฯ เพื่อจำหน่ายสินค้าหรือให้บริการรวมถึงการดำเนินการตามแผนการตลาดของบริษัทฯ ภายใต้ขอบเขตของบริษัทฯ
            </p>
            <p class="indent-8 text-justify">
                3.ผู้ลงทุน หมายถึง บุคคลที่เป็นเจ้าของกรรมสิทธิ์ในกิจการ ในสัญญาฉบับนี้ให้หมายถึงบริษัท ทศกัณฐ์ ดิจิตอล นิวเจนเนอเรชั่น จำกัด
            </p>
            <p class="indent-8 text-justify">
                4.บริษัทฯ หมายถึง ทศกัณฐ์ ดิจิตอล นิวเจนเนอเรชั่น จำกัด
            </p>
            <p class="indent-8 text-justify">
                5.ข้อมูลส่วนบุคคล หมายถึง ข้อมูลเกี่ยวกับบุคคลซึ่งทำให้สามารถระบุตัวบุคคลนั้นได้ไม่ว่าทางตรง ทางอ้อม รวมถึงข้อมูลส่วนบุคคลตามกฎหมายเกี่ยวกับการคุ้มครองข้อมูลส่วนบุคคล
            </p>
            <p class="indent-8 text-justify">
                6.ข้อมูลอันเป็นความลับ หมายถึง ข้อมูลส่วนบุคคล หรือข้อมูลทางการค้า ความลับเชิงพาณิชย์ ข้อมูลที่เป็นความลับหรือทางการค้าเกี่ยวกับบริษัทฯ และคู่สัญญาของบริษัทฯ
            </p>
            <p class="indent-8 text-justify">
                7.ทรัพย์สินทางปัญญา หมายถึง สิทธิในทรัพย์สินทางปัญญาทั้งปวงอันรวมถึงแต่ไม่จำกัดเพียง ลิขสิทธิ์ สิทธิบัตร เครื่องหมายทางการค้า เครื่องหมายบริการ ซึ่งทางการค้า หรือการออกแบบ ระบบงานใดที่เกิดจากการสร้างสรรค์ คิดค้น ออกแบบ
            </p>
            <p class="indent-8 text-justify">
                8.เหตุสุดวิสัย หมายถึง เหตุใดๆ ที่คู่สัญญาไม่อาจป้องกัน หรือมิได้เกิดจากการกระทำของคู่สัญญานั้น แม้ว่าจะได้ใช้ความระมัดระวังอันตามสมควรอันพึงคาดหมายได้จากบุคคลในฐานและภาวะเช่นนั้นซึ่งได้แก่ เหตุที่เกิดจากภัยธรรมชาติ เช่น น้ำท่วม ไฟไหม้ แผ่นดินไหว หรือเกิดจากการใช้อำนาจรัฐ หรือการกระทำโดยบุคคลภายยอก หรือปัจจัยภายนอก
            </p>
            <p class="indent-8 text-justify">
                9.สินค้า หมายถึง สินค้าที่เจ้าของสินค้าทำการผลิต หรือนำเข้า หรือสินค้าประเภทอื่นๆ ที่เกี่ยวข้องที่มี ณ ปัจจุบัน หรือจะมีเพิ่มเติมในอนาคต ที่เจ้าของสินค้าฝากให้แก่บริษัทฯเพื่อจำหน่ายให้แก่ลูกค้า หรือสินค้าที่ทางบริษัทจัดหาหรือผลิตเอง
            </p>
            <p class="indent-8 text-justify">
                10.<span class="text-red-500">www.xxxxxxx</span> หมายถึง เว็บไซต์ของบริษัทฯ ในการซื้อขายสินค้า หรือบริการจัดการธุรกรรมซื้อขายผลิตภัณฑ์ต่างๆ และให้หมายความรวมถึงเว็บไซต์อื่นๆของบริษัทฯ ที่จะมีขึ้นในอนาคตด้วย
            </p>
            <p class="indent-8 text-justify">
                11.ทุกช่องทางของบริษัทฯ หมายถึง ช่องทางออนไลน์อื่นใด ที่อยู่ภายใต้เว็บไซต์ของบริษัทฯลูกค้า หมายถึง บุคคลธรรมดา ร้านค้า หรือนิติบุคคลทั่วไป ที่ซื้อสินค้าจากเจ้าของสินค้าในลักษณะซื้อ-ขายเสร็จเด็ดขาดบนหน้าเว็บไซต์ <span class="text-red">www.xxxxxxx</span> หรือทุกช่องทางของบริษัท
            </p>
        </article>

        <article class="text-balance mb-3">
            <h1 class="mb-2"><strong>2. ความสัมพันธ์ตามสัญญา</strong></h1>
            <p class="indent-8 text-justify">
                1.ผู้เปิดศูนย์ ได้สมัครเพื่อให้บริการดำเนินการตามแผนการตลาดของบริษัทฯ เพื่อเป็นสื่อกลางในการให้บริหารงานภายใต้ขอบเขตที่บริษัทฯกำหนดและให้ข้อมูลข่าวสาร องค์ความรู้แก่ตัวแทนศูนย์ ภายใต้พื้นที่ที่สมาชิกดูแล และรับสมัครสมาชิกตลอดจนชี้แจงประสานงานและให้บริการข้อมูลข่าวสารแก่สมาชิก และบริการอื่นๆตามแผนการตลาดของบริษัทฯ
            </p>
            <p class="indent-8 text-justify">
                2.ผู้เปิดศูนย์ จะได้รับหนังสือแต่งตั้งการเป็นตัวแทนตามประเภท ออกเป็นหนังสือติดตั้งไว้ ณ ศูนย์บริการของท่านเสมือนเป็นตัวแทนของบริษัทฯ พร้อมทั้งเอกสารที่เกี่ยวข้อง
            </p>
            <p class="indent-8 text-justify">
                3.ผู้เปิดศูนย์ ทราบและเข้าใจเป็นอย่างดีว่า บริษัทฯเป็นผู้ให้บริการการตลาดแบบตรง หรือเป็นสื่อกลางกับผู้ใช้บริการ และผู้บริโภคผ่านเว็บไซต์ หรือทุกช่องทางของบริษัทฯเพื่อเป็นช่องทางในการซื้อขายสินค้า หรือบริการจัดการธุรกรรมซื้อขายผลิตภัณฑ์ต่างๆ ซึ่งต่อไปนี้เรียกว่า “ระบบแพลตฟอร์ม” โดยผู้เปิดศูนย์ตกลงใช้บริการแพลตฟอร์ม และบริษัทฯตกลงให้ผู้เปิดศูนย์ใช้ระบบแพลตฟอร์มดังกล่าว ตามประเภทที่ได้เลือกตามความสมัครใจของผู้เปิดศูนย์แต่ละประเภท โดยใบแต่งตั้งทางบริษัทฯจะอนุมัติและออกให้ตามประเภทที่เลือกนั้น ๆ
            </p>
        </article>

        <article class="text-balance mb-3">
            <h1 class="mb-2"><strong>3. เครื่องหมายทางการค้าในธุรกิจ</strong></h1>
            <p class="indent-8 text-justify">
                1.เครื่องหมายหรือสัญลักษณ์การเป็นตัวแทนของบริษัทฯตลอดจนเว็บไซต์แอพพลิเคชั่น และสื่อการตลาดทุกรูปแบบ รวมถึงทรัพย์สินทางปัญญา นวัตกรรม ฯลฯ ของบริษัทฯเพื่อให้ใช้สิทธิต่างๆ ตามสัญญาฉบับนี้มีผลบังคับใช้เพื่อให้มีการเปิดศูนย์บริการฝากขายสินค้าและบริการเป็นไปตามที่ส่วนกลางกำหนด ไม่อนุญาตให้ดัดแปลง แก้ไข โดยไม่ได้รับอนุญาตเป็นลายลักษณ์อักษรจากทางบริษัทฯ
            </p>
            <p class="indent-8 text-justify">
                2.ผู้เปิดศูนย์จะต้องใช้เครื่องหมายทางการค้าตามสัญญาฉบับนี้เพื่อประกอบกิจการค้าตามปกติ และอยู่ภายใต้ขอบเขตที่กำหนดไว้ในสัญญา ผู้เปิดศูนย์ตกลงว่าจะไม่กระทำการใดๆอันเป็นการรบกวนหรือแย้งกับสิทธิประโยชน์เจ้าของเครื่องหมายทางการค้ารวมถึงผู้มีส่วนเกี่ยวข้อง ไม่ว่าจะกระทำเพื่อตนเอง หรือผู้อื่นตลอดจนจะไม่กระทำการใดๆ หรือยอมให้กระทำการฝ่าฝืนกฎหมายหรือขัดต่อความสงบเรียบร้อย หรือศีลธรรมอันดีของประชาชน หรือก่อให้เกิดความรำคาญ หรือเป็นที่น่ารังเกียจแก่บุคคลใดในสภาพที่ประกอบการค้านั้น
            </p>
            <p class="indent-8 text-justify">
                3.ผู้เปิดศูนย์ฯ จะต้องป้องกันเครื่องหมาย สัญลักษณ์หรือเครื่องหมายทางการค้าดังกล่าวมิให้ผู้อื่นกระทำการล่วงล้ำสิทธิในเครื่องหมายทางการค้าของบริษัทฯ ไม่ว่าจะเป็นการใช้เครื่องหมายปลอม การลอกเลียนแบบเครื่องหมายทางการค้า การใช้รูปรอยประดิษฐ์ หรือข้อความใดๆ หากพบเห็นจะต้องแจ้งให้บริษัทฯ ทราบทันที
            </p>
        </article>

        <article class="text-balance mb-3">
            <h1 class="mb-2"><strong>4. ระยะเวลาในการให้สิทธิประกอบธุรกิจ</strong></h1>
            <p class="indent-8 text-justify">
                1.ระยะเวลาในการให้สิทธิในการประกอบธุรกิจระยะเวลา 3 ปีตามสัญญาฉบับนี้ บริษัทฯตกลงให้ใช้สิทธิในการประกอบธุรกิจแก่ผู้เปิดศูนย์มีผลตลอดระยะเวลาตามสัญญาในการเปิดศูนย์ให้บริการภายใต้ความดูแลและควบคุมของบริษัทฯ สิทธิในการประกอบธุรกิจมีผลจนกว่าคู่สัญญาฝ่ายใดฝ่ายหนึ่งจะปฏิบัติตามเงื่อนไขการสิ้นสุดของสัญญา
            </p>
            <p class="indent-8 text-justify">
                2.ระยะเวลาการเปิดศูนย์บริการลูกค้า คือไม่มีกำหนดระยะเวลา จนกว่าจะมีประกาศเปลี่ยนแปลงเป็นลายลักษณ์อักษร
            </p>
        </article>

        <article class="text-balance mb-3">
            <h1 class="mb-2"><strong>5. ประเภทแฟรนไชส์</strong></h1>
            <p class="indent-8 text-justify">
                ผู้เปิดศูนย์สามารถเลือกประเภทของศูนย์บริการได้ตามความสมัครใจ โดยมีรายละเอียดเพิ่มเติมในส่วนของค่าตอบแทนทางการตลาด ดังต่อไปนี้
            </p>
            <p class="indent-8 text-justify">
                อัตราค่าตอบแทน 100% = ผู้บริหารศูนย์ 70%, ผู้ลงทุน(บริษัทฯ) 20%, ค่าบริการ , ระบบ 10% ของกำไรสุทธิหลังหักต้นทุนและค่าใช้จ่ายทางการตลาด (ค่าส่งเสริมการตลาด อาธิ เงินคืน กองทุน Allsale โบนัส) ตามแผนบริษัทฯ กำหนด
            </p>
        </article>

    </div>
</template>
  
<script>
export default {
    data() {
        return {
            currentDate: new Date().toLocaleDateString(),
            customerName: "John Doe",
            customerContact: "+1 123 456 789",
            customerEmail: "john.doe@example.com",
            items: [
                { name: "Product 1", description: "Description of Product 1", quantity: 1, price: 10 },
                { name: "Product 2", description: "Description of Product 2", quantity: 2, price: 20 },
                { name: "Product 3", description: "Description of Product 3", quantity: 1, price: 15 }
            ]
        };
    },
    computed: {
        calculateTotal() {
            return this.items.reduce((total, item) => total + (item.quantity * item.price), 0);
        }
    }
};
</script>
  
<style scoped>
.contract-paper {
    font-family: Arial, sans-serif;
    width: 210mm;
    height: auto;
    padding-bottom: 20px;
    padding-left: 100px;
    padding-right: 100px;
    box-sizing: border-box;
}

.header {
    text-align: center;
    margin-bottom: 20px;
}

.quotation-details {
    margin-bottom: 20px;
}

.items-table {
    width: 100%;
    border-collapse: collapse;
}

.items-table th,
.items-table td {
    border: 1px solid #ccc;
    padding: 8px;
}

.total {
    margin-top: 20px;
}
</style>
  